{"pageProps":{"postData":{"id":"how-to-setup-local-development-for-mjml-framework","contentHtml":"<p>Are you still building your email templates with just plain HTML where you write code in an old and unconventional way with too much repetition resulting in large amounts of code that's very hard to maintain? Well, say no more. There's already an email framework that makes it less painful to build responsive email templates. It's called <a href=\"https://mjml.io/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">MJML</a> - short for Mailjet Markup Language. Originally created by a team of developers at <a href=\"https://www.mailjet.com/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Mailjet</a>, MJML's objective is to simplify the way people design responsive emails.</p>\n<p>From the first glimpse of this framework, I was already hooked because this is exactly what I needed to improve my experience in building email templates. I knew I had to try it out right away. I'm glad I did because I'm now able to write less, save time and code more efficiently. I've shared my experience with this framework with my colleagues and they were also amazed and convinced. The semantic syntax is so <strong>simple</strong>! I didn't have to struggle as much with responsiveness as it works well on different email platforms, even on Outlook. If you're still not convinced, you can learn more about this framework <a href=\"https://mjml.io/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">here</a>.</p>\n<p>If you're already on board and ready to get started, I'll now teach you how to set up local development for MJML framework. This will give you a head start and help you build your email template even faster. Alright, let's do this!</p>\n<p>By the way, upon writing this blog, I assume that you have some web development background and basic knowledge regarding <a href=\"https://www.npmjs.com/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">npm</a>, <a href=\"https://classic.yarnpkg.com/lang/en/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">yarn</a>, <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">HTML</a> and <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">CSS</a>.</p>\n<p>Some prerequisites below. Make sure to install them if you haven't!</p>\n<ul>\n<li><a href=\"https://code.visualstudio.com/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Visual Studio Code</a></li>\n<li><a href=\"https://classic.yarnpkg.com/lang/en/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Yarn</a></li>\n</ul>\n<p>We'll be using <a href=\"https://code.visualstudio.com/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Visual Studio Code</a> as our <a href=\"https://en.wikipedia.org/wiki/Integrated_development_environment\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">IDE</a> in this tutorial as we will utilize a few extensions from their <a href=\"https://marketplace.visualstudio.com/vscode\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">marketplace</a>. And we'll use <a href=\"https://classic.yarnpkg.com/lang/en/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Yarn</a> as our package manager, it's just like <a href=\"https://www.npmjs.com/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">npm</a> but <em>faster</em>.</p>\n<p>Now, create your folder and give it a name that best describes your email template. This will be the root folder of your code.</p>\n<pre><code>mkdir sample-email-template\n</code></pre>\n<p>Open the created folder in your Visual Studio Code.</p>\n<p>Then create a folder and name it <code>src</code>. Inside it, create a file named <code>index.mjml</code>.</p>\n<p>Now, open the terminal in Visual Studio Code. The keyboard shortcut would be <code> Ctrl</code> + <code>`</code>.</p>\n<p>Then, initiliaze Yarn using the command below:</p>\n<pre><code>yarn init -y\n</code></pre>\n<p>It will create a <code>package.json</code> file. The command parameters <code>-y</code> will skip the interactive session and use the default options. Feel free to modify the file later if you need to.</p>\n<p>Then create an empty <code>yarn.lock</code> in the root folder because you might receive an error saying \"The nearest package directory /folder/to/current/xxx doesn't seem to be part of the project declared in /folder/to/outside/xxx.\"</p>\n<p>Okay, let's now install MJML library as <code>devDependencies</code> using the the command below:</p>\n<pre><code>yarn add -D mjml\n</code></pre>\n<p>Once installed, open your <code>package.json</code> and modify it to add the MJML build command in the scripts. This command will generate the HTML file based from your MJML file.</p>\n<pre><code>{\n  ...\n  \"scripts\": {\n    \"build\": \"mjml src/index.mjml --output src/index.html\"\n  }\n}\n</code></pre>\n<p>Then click on the \"Extensions\" tab and look for \"MJML\" and install it. You can also install it via this <a href=\"https://marketplace.visualstudio.com/items?itemName=mjmlio.vscode-mjml\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">link</a>.</p>\n<p><img src=\"/images/posts/how-to-setup-local-development-for-mjml-framework/install-mjml-extension-in-visual-studio-code.png\" alt=\"Screenshot of how to install MJML extension in Visual Studio Code\"></p>\n<p>If you have a decent-sized monitor with a resolution of at least 1920 x 1080, then you're done with this setup! That's because the MJML extension already has a live preview for MJML files. Within Visual Studio code, you can click on the MJML logo located on the top right corner. It will split the screen between your code and the preview so you can see updates as you type. This extension can also show inline errors, provide code snippets and many more!</p>\n<p>Let's try out the preview feature of MJML extension. Open your <code>index.mjml</code>, it should show the MJML logo on the top right corder of your Visual Studio Code, click it and it will split the screen.</p>\n<p>Now, update your <code>index.mjml</code> to add the code below:</p>\n<pre><code>&#x3C;mjml>\n  &#x3C;mj-body background-color=\"white\">\n    &#x3C;mj-section>\n      &#x3C;mj-column>\n        &#x3C;mj-text>\n          Hello World\n        &#x3C;/mj-text>\n      &#x3C;/mj-column>\n    &#x3C;/mj-section>\n  &#x3C;/mj-body>\n&#x3C;/mjml>\n</code></pre>\n<p>You should be able to see the text on the preview side. Very cool!</p>\n<p><img src=\"/images/posts/how-to-setup-local-development-for-mjml-framework/preview-mode-of-mjml-extension-in-visual-studio-code.png\" alt=\"Screenshot of preview mode feature of MJML extension in Visual Studio Code\"></p>\n<p>When you're done writing MJML code, you can generate the HTML by running the command below:</p>\n<pre><code>yarn build\n</code></pre>\n<p>If you're coding in a smaller-sized screen or prefer to have a wider screen for your code or maybe just an <code>Alt</code> + <code>Tab</code> kind of developer, then let's continue for the additional setup.</p>\n<p>Install the <a href=\"https://github.com/tapio/live-server\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Live Server</a> and <a href=\"https://github.com/open-cli-tools/concurrently\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Concurrently</a> using the command below. Live Server will create a server locally, it will help us serve the generated <code>index.html</code> by MJML so you can preview it in a browser. Concurrently will let us run multiple scripts with one script so you don't have to open multiple terminal windows to achieve the same thing.</p>\n<pre><code>yarn add -D live-server concurrently\n</code></pre>\n<p>Once installed, open your <code>package.json</code> again and update the scripts with the following code below:</p>\n<pre><code>  \"scripts\": {\n    \"start\": \"mjml --watch src/index.mjml --output src/index.html\",\n    \"server\": \"live-server --host=localhost --open=src\",\n    \"dev\": \"concurrently \\\"yarn start\\\" \\\"yarn server\\\"\",\n    \"build\": \"mjml src/index.mjml --output src/index.html\",\n  },\n</code></pre>\n<p>Let's understand each command that was newly added. The <code>start</code> script is basically the same as the <code>build</code> script but with a <code>--watch</code> parameter, which means it will be running in the background to watch for file changes and update the HTML file so we don't have to manually run the <code>build</code> script for every change. The <code>server</code> script is to start a server locally and serve the files under the <code>src</code> folder, specifically our <code>index.html</code> so we can view it in the browser. Since we have 2 scripts that needs to run at the same time, we created the <code>dev</code> script which will utilize <code>concurrently</code> to run both the <code>start</code> and the <code>server</code> script.</p>\n<p>Let's run our <code>dev</code> script by typing the command below on our terminal:</p>\n<pre><code>yarn run dev\n</code></pre>\n<p>This command will open your default browser and go to <code>http://localhost:8080/src/</code>. If it doesn't, you can do it yourself too. You should be able to see the page with the text <code>Hello World</code> displayed on your browser. This is the <code>index.html</code> served by our local server.</p>\n<p>Now go back to Visual Studio Code and try do make some changes in the <code>index.mjml</code> file.</p>\n<pre><code>...\n  &#x3C;mj-text>\n    Hello Moon\n  &#x3C;/mj-text>\n...\n</code></pre>\n<p>Once you saved the file, it should be automatically update the <code>index.html</code> and reflect on the browser.</p>\n<p>That's it! You now have a local development setup for MJML framework and can start building your email template. I hope this was helpful and please don't forget to share. I'll be doing another blog soon where I'll build an email template using MJML with this local development setup. So stay tuned!</p>\n<p>Cheers ~</p>\n","previousPost":null,"nextPost":null,"title":"How to set up a local development for MJML framework","date":"2021-08-24","excerpt":"Get a head start with MJML framework to help you build your email template faster","category":"technology"}},"__N_SSG":true}